tap "github/bootstrap"
tap "github/packages"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "nodenv/nodenv"
tap "yt-dlp/taps"
# Automate deployment, configuration, and upgrading
brew "ansible"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Extendable version manager with support for Ruby, Node.js, Erlang & more
brew "asdf"
# Shell extension to jump to frequently used directories
brew "autojump"
# Official Amazon AWS command-line interface
brew "awscli"
# Microsoft Azure CLI 2.0
brew "azure-cli"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Decentralized dependency manager for Cocoa
brew "carthage"
# Load/unload environment variables based on $PWD
brew "direnv"
# Pack, ship and run any application as a lightweight container
brew "docker"
# Tool for managing dock items
brew "dockutil"
# Select default apps for documents and URL schemes on macOS
brew "duti"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Terminal JSON viewer
brew "fx"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Git extension for versioning large files
brew "git-lfs"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Mini DNS server designed solely to route queries to localhost
brew "launchdns"
# Keep your Mac's application settings in sync
brew "mackup"
# Mac App Store command-line interface
brew "mas"
# Open source relational database management system
brew "mysql", restart_service: true
# Platform built on V8 to build network applications
brew "node"
# Platform built on V8 to build network applications
brew "node@16"
# Shell command parallelization utility
brew "parallel"
# General-purpose scripting language
brew "php"
# Parallel gzip
brew "pigz"
# Pinentry for GPG on Mac
brew "pinentry-mac"
# Parallel versions of OpenSSH and related tools
brew "pssh"
# Interpreted, interactive, object-oriented programming language
brew "python@3.8"
# Emulator for x86 and PowerPC
brew "qemu"
# Persistent key-value database, with built-in net interface
brew "redis"
# GNU Make with improved error handling, tracing, and a debugger
brew "remake"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Safe, concurrent, practical language
brew "rust"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Cross-shell prompt for astronauts
brew "starship"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Terraform version manager inspired by rbenv
brew "tfenv"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Internet file retriever
brew "wget"
# Homebrew, but with Docker images
brew "whalebrew"
# JavaScript package manager
brew "yarn"
# Download YouTube videos from the command-line
brew "youtube-dl"
# UNIX shell (command interpreter)
brew "zsh"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# AWS role assumption tool
brew "github/packages/awssume"
# A youtube-dl fork with additional features and fixes
brew "yt-dlp/taps/yt-dlp"
# Password manager that keeps all passwords secure behind one password
cask "1password-beta"
# Apple TV Aerial screensaver
cask "aerial"
# Menu bar tool to limit maximum charging percentage
cask "aldente"
# Application launcher and productivity software
cask "alfred"
# CPU management applicataion
cask "app-tamer"
# Application uninstaller
cask "appcleaner"
# Multi-cloud backup application
cask "arq"
# Menu bar icon organizer
cask "bartender"
# Universal chat app powered by Matrix, unifying 15 different chat networks
cask "beeper"
# Scriptable scratchpad for developers
cask "boop"
# Official internet speed test from the German Bundesnetzagentur
cask "breitbandmessung"
cask "caldigit-docking-utility"
# Contacts manager
cask "cardhop"
# Web debugging Proxy application
cask "charles"
# Open links in any browser
cask "choosy"
# Screen capturing tool
cask "cleanshot"
# Tool to show live information about the batteries in various devices
cask "coconutbattery"
# Disk space visualizer
cask "daisydisk"
# Photography workflow application and raw developer
cask "darktable"
# API documentation browser and code snippet manager
cask "dash"
# Databases & SQL IDE
cask "datagrip"
cask "deckset"
# Voice and text chat software
cask "discord"
# Control your Elgato Key Lights
cask "elgato-control-center"
# Menu bar utility for Elgato Thunderbolt docks
cask "elgato-thunderbolt-dock"
# VPN and encryption software
cask "encryptme"
# Calendar software
cask "fantastical"
# Web browser
cask "firefox"
cask "font-barlow-condensed"
cask "font-fira-code"
cask "font-fira-code-nerd-font"
cask "font-fira-mono"
# Typeface made for developers
cask "font-jetbrains-mono"
cask "font-open-sans"
cask "font-permanent-marker"
# Desktop client for GitHub repositories
cask "github"
# Git interface focused on visual interaction
cask "gitup"
# Open-source video transcoder
cask "handbrake"
# Free and open-source media player
cask "iina"
# Tool to optimize images to a smaller size
cask "imageoptim"
# iPhone management application
cask "imazing"
# System monitoring app
cask "istat-menus"
# Transmits computer or server’s vital statistics
cask "istat-server"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Spot and merge differences in text and image files or folders
cask "kaleidoscope"
# Display all currently loaded kexts
cask "kextviewr"
# Create, manage and debug system- and user services
cask "launchcontrol"
# Provides access to camera controls
cask "logitech-camera-settings"
# Media key forwarder for iTunes and Spotify
cask "macmediakeyforwarder"
# Detailed information on every Apple product ever made
cask "mactracker"
# Track and update to the latest versions of installed software
cask "macupdater"
# Simple and elegant markdown editor
cask "mark-text"
# Provides updates to various Microsoft products
cask "microsoft-auto-update"
# Web browser
cask "microsoft-edge"
# Multi-platform web browser
cask "microsoft-edge-beta"
# Office suite
cask "microsoft-office"
# Meet, chat, call, and collaborate in just one place
cask "microsoft-teams"
# German banking and financial management software
cask "moneymoney"
# Silence embarrassing notifications while screensharing
cask "muzzle"
# HTTP client that helps testing and describing APIs
cask "paw"
# Home media player
cask "plex"
# Podcast platform
cask "pocket-casts"
# Collaboration platform for API development
cask "postman"
# Tool to organize photo libraries
cask "powerphotos"
# Modern and intuitive HTTP Debugging Proxy app
cask "proxyman"
# QuickLook plugin for JSON files
cask "quicklook-json"
# Network monitor and firewall
cask "radio-silence"
# Imaging utility to install operating systems to a microSD card
cask "raspberry-pi-imager"
# Control your tools with a few keystrokes
cask "raycast"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Time optimising application
cask "rescuetime"
# Emoji picker optimized for blind people
cask "rocket"
# Official desktop client for Rocket.Chat
cask "rocket-chat"
# Ruby on Rails IDE
cask "rubymine"
# Remote access software focusing on usability
cask "screens"
# Remote desktop software
cask "screens-connect"
# Store SSH keys in the Secure Enclave
cask "secretive"
# Instant messaging application focusing on security
cask "signal"
# Digital design and prototyping platform
cask "sketch"
# Video chat, voice call and instant messaging application
cask "skype"
# Team communication and collaboration software
cask "slack"
# Application to control your PlayStation 4 or PlayStation 5
cask "sony-ps-remote-play"
# Application to control your PlayStation 4
cask "sony-ps4-remote-play"
# Notepad with a built-in calculator
cask "soulver"
# Sound and audio controller
cask "soundsource"
# Music streaming service
cask "spotify"
# Tool for managing the OpenSSH ssh client configuration file
cask "ssh-config-editor"
# Video game digital distribution service
cask "steam"
# Tool to manage Synology NAS's across a LAN
cask "synologyassistant"
# App to edit markdown files in place
cask "tableflip"
# Messaging app with a focus on speed and security
cask "telegram"
# Helper application for Things
cask "thingsmacsandboxhelper"
# Utility to hide the notch
cask "topnotch"
# Git client focusing on power and productivity
cask "tower"
# File transfer application
cask "transmit"
# Control your data usage on slow or expensive networks
cask "tripmode"
# Open-source code editor
cask "visual-studio-code"
# Code editor
cask "visual-studio-code-insiders"
# Create, manage, and run virtual machines
cask "vmware-fusion-tech-preview"
# Desktop client for WhatsApp
cask "whatsapp"
# Install and switch between multiple versions of Xcode
cask "xcodes"
mas "1Blocker", id: 1365531024
mas "1Password for Safari", id: 1569813296
mas "Bear", id: 1091189122
mas "Deliveries", id: 290986013
mas "ICE Buddy", id: 1595947689
mas "Keynote", id: 409183694
mas "LG Screen Manager", id: 1142051783
mas "MacFamilyTree 10", id: 1567970985
mas "Messenger", id: 1480068668
mas "Netmo", id: 1192219511
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Patterns", id: 429449079
mas "PDF Toolkit+", id: 545164971
mas "Pixelmator Pro", id: 1289583905
mas "Spark", id: 1176895641
mas "SponsorBlock for YouTube - Skip Sponsorships", id: 1573461917
mas "StopTheMadness", id: 1376402589
mas "stts", id: 1187772509
mas "TestFlight", id: 899247664
mas "Trello", id: 1278508951
mas "Tweetbot", id: 1384080005
mas "Twitter", id: 1482454543
mas "Velja", id: 1607635845
mas "Webcam Settings", id: 533696630
mas "WiFi Signal", id: 525912054
mas "xScope", id: 889428659
